// 证件类型
export const CARD_TYPE_MAP = {
  '111': '大陆身份证',
  '114': '军官证',
  '513': '港澳通行证',
  '511': '台湾居民来往大陆通行证',
  '516': '港澳同胞回乡证',
  '117': '出生证',
  '235': '士兵证',
  '113': '户口薄',
  '123': '警官证',
  '133': '学生证',
  '115': '文职干部证',
  'A01': '香港居民身份证',
  'A02': '澳门居民身份证',
  'A03': '护照',
  'A04': '台湾居民身份证',
  'B01': '营业执照',
  'B02': '组织机构代码证',
  'B03': '税务登记证',
  '990': '其他'
};
// 性别
export const SEX_MAP = {
  '0': '未知',
  '1': '男',
  '2': '女'
};
// 员工在职状态
export const EMPLOYEE = {
  '1': '在职',
  '2': '离职'
};
//广告管理跳转类型
export const ADVERTISE_SKIP_TYPE = {
  '0': "链接",
  '1': "自定义",
  '2': "模块",
  '3': "小程序",
  '4': "不跳转"
};
//广告管理触发方式
export const TRIGGER_MODE = {
  '0': "App首页",
  '1': "蓝牙开门",
  '2': "支付成功"
};
//广告管理位置
export const LOCATION = {
  '3': "首页广告区域",
  '4': "首页banner",
};
//婚姻状态
export const MARITAL_STATUS = {
  '10': "单身",
  '20': "已婚",
};
//家庭结构
export const FAMILY_STRUCTURE = {
  '11': "单身青年独居",
  '12': "单身与父母同住",
  '13': "老人独居",
  '21': "已婚无小孩",
  '22': "已婚有小孩",
  '23': "三代同堂",
};
